/**
 题目内容
已知所有大于1的整数都可以被唯一分解成质数的乘积，我们把这组质数称为该整数的质因子；如：12 = 2 ×2 ×3，12的质因子为[2,3]，7 = 1 × 7，7的质因子为 [7]。
现给定一个正整数n 和一个质数列表nums(数字严格递增)，请统计数字1 ～ n之中，有哪些数字的质因子仅出现在列表nums内，返回符合条件的数字数量。
注意：数字1无质因子，作为符合条件的数字纳入统计。
质数定义：大于1的自然数，除了1和它自身外不能被其他自然数整除的数。
数据范围: 整数 n 范围: 1 ≤ n ≤ 10¹²；列表 nums 长度 m 范围: 1 ≤ m ≤ 5。
输入描述
输入为一行，包含正整数n，质数列表长度m，以及质数列表nums(以数组Q形式给出)
输出描述
输出一个整数，表示1 ～ n 中质因子仅出现在列表nums 内的数字数量。
15 3
2 3 5

*/


function solve(n, nums) {
    let ans = 0n;
    
    const dfs = (i, cur) => {
        if (i === nums.length) {
            ans++;
            return;
        }
        
        let x = cur;
        while (x <= n) {
            dfs(i + 1, x);
            if (x > n / nums[i]) break;
            x *= nums[i];
        }
    };
    
    dfs(0, 1n);
    return ans.toString();
}

/**
 这道题的黄金思路是： 我主动去寻找符合的数字

 我原本的破旧固化思维是： 我遍历每一个数， 然后判断这个数符不符合条件
 */